"use client";
import Button from "@/app/_components/Button";
import Multi from "@/app/_components/MultiParts";
import Slider from "@/app/_components/SliderProduct";

interface PageProps {
  params: { ShopId: string };
}

const fakeProduct = {
  images: [
    "https://roti-preview.taymakz.ir/assets/images/products/p1.png",
    "https://roti-preview.taymakz.ir/assets/images/products/p2.png",
    "https://roti-preview.taymakz.ir/assets/images/products/p3.png",
  ],
  title: "کفش پیاده روی مردانه نیو بالانس مدل Mdrftlm2",
  specifications: [
    { key: "جنس", value: "پارچه" },
    { key: "جنس", value: "پارچه" },
    { key: "جنس", value: "پارچه" },
  ],

  comments: [
    {
      suggestion: true,
      like: 100,
      dislike: 120,
      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
      title: "قیمت محصول",
    },
    {
      title: "قیمت محصول",
      suggestion: false,
      like: 100,
      dislike: 120,
      comment: "به درد نمیخوره اصلا مناسب نیست به شما هم پیشنهاد میکنم نخرید",
    },
    {
      title: "قیمت محصول",

      suggestion: true,
      like: 100,
      dislike: 120,
      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
    },
    {
      title: "قیمت محصول",

      suggestion: true,
      like: 100,
      dislike: 120,
      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
    },
    {
      suggestion: true,
      title: "قیمت محصول",
      like: 100,
      dislike: 120,
      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
    },
    {
      suggestion: true,
      like: 100,
      title: "قیمت محصول",
      dislike: 120,
      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
    },
    {
      suggestion: true,
      title: "قیمت محصول",
      like: 100,
      dislike: 120,
      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
    },
    {
      suggestion: true,
      title: "قیمت محصول",
      like: 100,
      dislike: 120,
      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
    },
    {
      suggestion: true,
      like: 100,
      dislike: 120,
      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
      title: "قیمت محصول",
    },
    {
      suggestion: true,
      like: 100,
      title: "قیمت محصول",
      dislike: 120,
      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
    },
    {
      suggestion: true,
      like: 100,
      title: "قیمت محصول",

      dislike: 120,
      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
    },
    {
      suggestion: true,
      like: 100,
      dislike: 120,
      title: "قیمت محصول",

      comment: "با این قیمت مناسبه و من پیشنهاد میکنم",
    },
  ],

  caption:
    "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
};

function Page({ params }: PageProps) {
  const { ShopId } = params;

  console.log(ShopId);

  const { images, title, caption, specifications, comments } = fakeProduct;

  return (
    <>
      <div className="fixed right-0 left-0 bottom-0 flex justify-between items-center bg-white px-4 py-3 dark:bg-gray-900 z-50 md:hidden">
        <Button onClick={() => {}}>افزودن به سبد خرید</Button>
        <div className="flex flex-col">
          <div className="flex justify-between items-center">
            <h3 className="text-gray-400 line-through decoration-2 decoration-color-danger-200 ">
              100,000
            </h3>
            <span className="bg-color-danger-200 text-gray-50 rounded-full size-6 flex justify-center items-center text-[12px]">
              10%
            </span>
          </div>
          <h3 className=" text-color-success-200 font-bold ">
            <span>80,000</span>
            <span>تومان</span>
          </h3>
        </div>
      </div>
      <div className="flex flex-col gap-4">
        <div className="w-full bg-white p-5 h-full dark:bg-gray-900 flex flex-col gap-4">
          <div className=" w-full aspect-square grid">
            <Slider images={images} />
          </div>
          <h3 className="dark:text-gray-50">{title}</h3>
          {/* <Counter /> */}
        </div>

        <Multi
          caption={caption}
          specifications={specifications}
          comments={comments}
        />
      </div>
    </>
  );
}

export default Page;
